Revit 2027 API
LoadBase.IsOrientToPermitted Method
 Indicates if the provided orientation is permitted for this load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOrientToPermitted(
	LoadOrientTo orientTo
)
Public Function IsOrientToPermitted (
	orientTo As LoadOrientTo
) As Boolean
public:
bool IsOrientToPermitted(
	LoadOrientTo orientTo
)
member IsOrientToPermitted :
        orientTo : LoadOrientTo -> bool
Parameters
orientTo LoadOrientTo
 Load orientation to check.
Return Value
Boolean
 True if provided orientation type is permitted for this load, false if not.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 For hosted load only LoadOrientTo.Project and LoadOrientTo.HostLocalCoordinateSystem are permitted. For non-hosted load only LoadOrientTo.Project and LoadOrientTo.WorkPlane are permitted. To determine if load is hosted use IsHosted property.
See Also
Reference
LoadBase Class
Autodesk.Revit.DB.Structure Namespace